Figure_18/zfs_qat_test/silesia_chunk_4kread_lat_test/latency_res/09_29-09_55/nocomp/4K/out_09_29-09_56_42.txt
#############################################################
align: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.35-118-g4a0c76
Starting 1 process

align: (groupid=0, jobs=1): err= 0: pid=31399: Sun Sep 29 09:57:50 2024
  read: IOPS=5738, BW=22.4MiB/s (23.5MB/s)(1513MiB/67476msec)
    clat (usec): min=3, max=1259, avg=86.53, stdev=43.36
     lat (usec): min=3, max=1259, avg=86.55, stdev=43.36
    clat percentiles (usec):
     |  1.00th=[   57],  5.00th=[   59], 10.00th=[   60], 20.00th=[   62],
     | 30.00th=[   65], 40.00th=[   69], 50.00th=[   74], 60.00th=[   85],
     | 70.00th=[   89], 80.00th=[   95], 90.00th=[  109], 95.00th=[  182],
     | 99.00th=[  285], 99.50th=[  297], 99.90th=[  351], 99.95th=[  392],
     | 99.99th=[  865]
   bw (  KiB/s): min= 5144, max=29584, per=100.00%, avg=22986.66, stdev=3669.98, samples=134
   iops        : min= 1286, max= 7396, avg=5746.65, stdev=917.50, samples=134
  lat (usec)   : 4=0.01%, 10=0.12%, 20=0.01%, 50=0.08%, 100=85.76%
  lat (usec)   : 250=11.90%, 500=2.11%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=50.34%, sys=10.59%, ctx=412668, majf=0, minf=8
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=100.0%, 4=0.1%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=387238,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=22.4MiB/s (23.5MB/s), 22.4MiB/s-22.4MiB/s (23.5MB/s-23.5MB/s), io=1513MiB (1586MB), run=67476-67476msec
 
zfs_prefetch_disable: 1
zfs_arc_max_val: 0
zfs_arc_min_val: 0
zfs_qat_compress_disable: 
 
compress_type: NAME         PROPERTY     VALUE           SOURCE
mypool/myfs  compression  off             local
 
blocksize: NAME         PROPERTY    VALUE    SOURCE
mypool/myfs  recordsize  4K       local
 
iters: 2
output_path: ./latency_res/09_29-09_55/nocomp/4K