Figure_18/zfs_qat_test/silesia_chunk_4kread_lat_test/latency_res/09_29-09_55/nocomp/4K/out_09_29-09_57_53.txt
#############################################################
align: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.35-118-g4a0c76
Starting 1 process

align: (groupid=0, jobs=1): err= 0: pid=31738: Sun Sep 29 09:59:00 2024
  read: IOPS=5756, BW=22.5MiB/s (23.6MB/s)(1513MiB/67275msec)
    clat (usec): min=4, max=1120, avg=86.28, stdev=41.19
     lat (usec): min=4, max=1120, avg=86.30, stdev=41.19
    clat percentiles (usec):
     |  1.00th=[   57],  5.00th=[   59], 10.00th=[   60], 20.00th=[   62],
     | 30.00th=[   65], 40.00th=[   69], 50.00th=[   75], 60.00th=[   84],
     | 70.00th=[   90], 80.00th=[   96], 90.00th=[  110], 95.00th=[  178],
     | 99.00th=[  281], 99.50th=[  297], 99.90th=[  367], 99.95th=[  408],
     | 99.99th=[  570]
   bw (  KiB/s): min= 4936, max=29640, per=100.00%, avg=23043.58, stdev=3717.76, samples=134
   iops        : min= 1234, max= 7410, avg=5760.90, stdev=929.44, samples=134
  lat (usec)   : 10=0.12%, 20=0.01%, 50=0.08%, 100=84.39%, 250=13.66%
  lat (usec)   : 500=1.73%, 750=0.02%, 1000=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=50.34%, sys=10.71%, ctx=412669, majf=0, minf=8
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=100.0%, 4=0.1%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=387238,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=22.5MiB/s (23.6MB/s), 22.5MiB/s-22.5MiB/s (23.6MB/s-23.6MB/s), io=1513MiB (1586MB), run=67275-67275msec
 
zfs_prefetch_disable: 1
zfs_arc_max_val: 0
zfs_arc_min_val: 0
zfs_qat_compress_disable: 
 
compress_type: NAME         PROPERTY     VALUE           SOURCE
mypool/myfs  compression  off             local
 
blocksize: NAME         PROPERTY    VALUE    SOURCE
mypool/myfs  recordsize  4K       local
 
iters: 2
output_path: ./latency_res/09_29-09_55/nocomp/4K